app/views/articles/show.html.erb


<%= @article.comments.size %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]