app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "vinent"], ["body", "test"], ["article_id", 2], ["created_at", "2015-10-05 14:25:00.888611"], ["updated_at", "2015-10-05 14:25:00.888611"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comments = @article.comments.create(comment_params)